Revit 2027 API
ElementId(Int64) Constructor
 Create an ElementId handle with the given 64-bit integer id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId(
	long id
)
Public Sub New (
	id As Long
)
public:
ElementId(
	long long id
)
new :
        id : int64 -> ElementId
Parameters
id Int64
The id.
See Also
Reference
ElementId Class
ElementId Overload
Autodesk.Revit.DB Namespace